Revit 2027 API
Dimension.DimensionShape Property
The shape of this dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DimensionShape DimensionShape { get; }
Public ReadOnly Property DimensionShape As DimensionShape
	Get
public:
property DimensionShape DimensionShape {
	DimensionShape get ();
}
member DimensionShape : DimensionShape with get
Property Value
DimensionShape
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace